// constants/regions.ts
export const REGION_OPTIONS = [
    {province:"서울", cities: [
        "종로구","중구","용산구","성동구","광진구","동대문구","중랑구","성북구",
        "강북구","도봉구","노원구","은평구","서대문구","마포구","양천구","강서구",
        "구로구","금천구","영등포구","동작구","관악구","서초구","강남구","송파구","강동구"
      ],},
    {province:"부산",cities: [
        "중구","서구","동구","영도구","부산진구","동래구","남구","북구",
        "강서구","해운대구","사하구","금정구","연제구","수영구","사상구","기장군"
      ],},
    {province:"대구",cities: [
        "중구","동구","서구","남구","북구","수성구","달서구","달성군"
      ]},
    {province:"인천",cities: [
        "중구","동구","미추홀구","연수구","남동구","부평구","계양구","서구","강화군","옹진군"
      ]},
    {province:"광주",cities: ["동구","서구","남구","북구","광산구"]},
    {province:"대전",cities: ["동구","중구","서구","유성구","대덕구"]},
    {province:"울산",cities: ["중구","남구","동구","북구","울주군"]},
    {province:"세종",cities: null},
    {province:"경기",cities:["수원","고양","용인","성남","부천","화성","안산","남양주","안양","평택","시흥","파주","의정부","김포","광주","광명","군포","하남","오산","양주","이천","구리","안성","포천","의왕","양평군","여주","동두천","가평","과천","연천"]},
    {province:"강원",cities:["춘천","원주","강릉","동해","태백","속초","삼척"]},
    {province:"충북",cities:["청주","충주","제천"]},
    {province:"충남",cities:["천안","공주","보령","아산","서산","논산","계룡","당진"]},
    {province:"전북",cities:["전주","군산","익산","정읍","남원","김제"]},
    {province:"전남",cities:["목포","여수","순천","나주","광양"]},
    {province:"경북",cities:["포항","경주","김천","안동","구미","영주","영천","상주","문경","경산"]},
    {province:"경남",cities:["창원","진주","통영","사천","김해","밀양","거제","양산"]},
    {province:"제주",cities:["제주","서귀포"]}
  ]
  